###############################################################
#  Generated by:      Cadence Innovus 15.23-s045_1
#  OS:                Linux x86_64(Host ID ieng6-ece-16.ucsd.edu)
#  Generated on:      Sat Mar 15 14:32:50 2025
#  Design:            core
#  Command:           saveDesign finalStepRC.enc -rc
###############################################################
current_design core
create_clock [get_ports {clk}]  -name clk -period 1.000000 -waveform {0.000000 0.500000}
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[8]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[6]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[4]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[16]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[2]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[14]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[0]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[12]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[10]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[9]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[7]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[5]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[3]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[15]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[1]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[13]}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {inst[11]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[117]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[131]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[124]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[11]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[71]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[64]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[57]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[0]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[118]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[132]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[125]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[12]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[72]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[65]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[58]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[1]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[119]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[140]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[133]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[126]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[20]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[13]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[80]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[73]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[66]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[59]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[141]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[134]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[127]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[21]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[14]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[2]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[81]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[74]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[67]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[142]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[135]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[128]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[22]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[15]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[3]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[82]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[75]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[68]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[30]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[23]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[16]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[4]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[150]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[143]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[136]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[129]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[83]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[90]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[76]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[69]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[31]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[24]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[17]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[5]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[151]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[144]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[137]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[84]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[91]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[77]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[6]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[152]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[145]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[138]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[32]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[25]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[18]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[85]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[92]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[78]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[100]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[7]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[153]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[146]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[139]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[40]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[33]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[26]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[19]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[86]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[93]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[79]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[101]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[8]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[154]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[147]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[41]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[34]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[27]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[87]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[94]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[102]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[9]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[155]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[148]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[42]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[35]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[28]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[88]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[95]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[103]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[110]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[156]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[149]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[50]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[43]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[36]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[29]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[89]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[96]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[104]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[111]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[157]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[51]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[44]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[37]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[97]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[105]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[112]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[158]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[52]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[45]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[38]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[98]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[106]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[113]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[120]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[60]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[53]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[46]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[39]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[159]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[99]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[107]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[114]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[121]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[61]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[54]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[47]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[108]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[115]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[122]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[62]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[55]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[48]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[109]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[116]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[130]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[123]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[10]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[70]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[63]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[56]}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {out[49]}]
